---
kind: type
id: T:Autodesk.Revit.Exceptions.InapplicableDataException
source: html/dc1a6d15-8923-a1fe-722a-4e976634a519.htm
---
# Autodesk.Revit.Exceptions.InapplicableDataException

The exception that is thrown when attempting to access a piece of data that is structurally not part of an object at the moment.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class InapplicableDataException : InvalidOperationException
```